{
  "_name_or_path": "google/vit-base-patch16-224-in21k",
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "A-01_鼠尾草",
    "1": "A-02_芸香",
    "2": "A-03_甜薰衣草",
    "3": "A-04_艾草",
    "4": "A-05_檸檬百里香",
    "5": "A-06_冰淇淋蘭香草",
    "6": "A-07_檸檬馬鞭草",
    "7": "A-08_芳香萬壽菊",
    "8": "A-09_紫蘇",
    "9": "A-10_小葉左手香",
    "10": "A-11_白斑左手香",
    "11": "A-12_檸檬左手香",
    "12": "A-13_金錢薄荷",
    "13": "A-14_防蚊草",
    "14": "A-15_迷迭香",
    "15": "B-01_九層塔",
    "16": "B-02_甜羅勒",
    "17": "B-03_甜薄荷",
    "18": "B-04_巧克力薄荷",
    "19": "B-05_奧勒岡",
    "20": "C-01_綠薄荷",
    "21": "C-02_香蜂草",
    "22": "C-03_貓薄荷"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "0": 0,
    "1": 1,
    "10": 2,
    "11": 3,
    "12": 4,
    "13": 5,
    "14": 6,
    "15": 7,
    "16": 8,
    "17": 9,
    "18": 10,
    "19": 11,
    "2": 12,
    "20": 13,
    "21": 14,
    "22": 15,
    "3": 16,
    "4": 17,
    "5": 18,
    "6": 19,
    "7": 20,
    "8": 21,
    "9": 22
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.47.1"
}
